In [1]:
import pandas as pd

## 예제 6-9  데이터 그룹화하기

In [2]:
book_data = pd.read_csv("../data/book_data.csv",encoding='cp949')

In [3]:
book_data.shape

(2000, 11)

In [4]:
book_data.get_dtype_counts()

int64      1
object    10
dtype: int64

In [5]:
book_data.columns

Index(['book_name', 'book_writer', 'book_date', 'book_price', 'book_cover',
       'book_page', 'book_size', 'book_weight', 'book_category',
       'book_publisher', 'sales_point'],
      dtype='object')

In [6]:
book_data.count()

book_name         2000
book_writer       2000
book_date         2000
book_price        2000
book_cover        1683
book_page         2000
book_size         1999
book_weight       2000
book_category     2000
book_publisher    2000
sales_point       2000
dtype: int64

In [7]:
book_data.head()

,book_name,book_writer,book_date,book_price,book_cover,book_page,book_size,book_weight,book_category,book_publisher,sales_point
0,올 더 빌딩스 인 런던,제임스 걸리버 핸콕,2018-08-25,"14,400",양장본,140,225*280mm,476,예술/대중문화,책발전소,110
1,렛 잇 블리드,이언 랜킨,2018-08-19,"13,320",반양장본,476,128*188mm,476,소설/시/희곡,오픈하우스,110
2,은유로 사회 읽기,대니얼 리그니,2018-08-20,"39,500",양장본,416,152*223mm,749,사회과학,한울(한울아카데미),10
3,유럽 맥주 여행,백경학,2018-08-24,"14,400",반양장본,308,150*220mm,400,역사,글항아리,10
4,"이게, 행복이 아니면 무엇이지",김혜령,2018-08-20,"13,050",NaN,288,135*200mm,374,인문학,웨일북,10

In [8]:
book_data.book_date.max()

'초판출간 2008년'

In [9]:
book_data.book_date.replace('초판출간 2008년', '2018-01-01',inplace=True)

In [10]:
book_data.book_date.max()

'2018-09-28'

In [11]:
book_data.book_cover.value_counts()

반양장본    1236
양장본      447
Name: book_cover, dtype: int64

In [12]:
book_data.book_cover.fillna("반양장본",inplace=True)

In [13]:
book_data.book_size.value_counts().head()

128*188mm    146
148*210mm    129
152*223mm    106
152*225mm    105
140*210mm     68
Name: book_size, dtype: int64

In [14]:
book_data.book_size.fillna('128*188mm',inplace=True)

In [15]:
book_data.count()

book_name         2000
book_writer       2000
book_date         2000
book_price        2000
book_cover        2000
book_page         2000
book_size         2000
book_weight       2000
book_category     2000
book_publisher    2000
sales_point       2000
dtype: int64

In [16]:
book_data.book_publisher.head()

0          책발전소
1         오픈하우스
2    한울(한울아카데미)
3          글항아리
4           웨일북
Name: book_publisher, dtype: object

In [17]:
book_data.book_publisher.value_counts().head()

위즈덤하우스          41
민음사             33
문학동네            28
창비              19
알에이치코리아(RHK)    17
Name: book_publisher, dtype: int64

In [18]:
book_data.book_price.value_counts().head()

13,500    221
10,800    188
11,700    170
14,400    149
12,600    122
Name: book_price, dtype: int64

In [19]:
book_data.book_price.value_counts().shape

(171,)

In [20]:
book_data_gr = book_data.groupby('book_price')

In [21]:
type(book_data_gr)

pandas.core.groupby.groupby.DataFrameGroupBy

In [22]:
book_data_gr.ngroups

171

In [23]:
type(book_data_gr.groups)

dict

In [24]:
book_data_gr.groups.keys()

dict_keys(['10,080', '10,260', '10,350', '10,450', '10,620', '10,710', '10,800', '11,160', '11,250', '11,400', '11,520', '11,700', '11,760', '112,100', '12,000', '12,150', '12,330', '12,350', '12,420', '12,510', '12,600', '12,750', '12,780', '12,870', '13,000', '13,050', '13,110', '13,300', '13,320', '13,410', '13,440', '13,500', '13,950', '14,000', '14,220', '14,250', '14,400', '14,850', '15,000', '15,120', '15,210', '15,300', '15,750', '16,000', '16,020', '16,110', '16,200', '16,500', '16,650', '16,920', '17,010', '17,100', '17,550', '17,820', '18,000', '18,530', '18,900', '19,000', '19,200', '19,620', '19,800', '20,000', '20,250', '20,700', '21,420', '21,600', '21,960', '22,000', '22,050', '22,500', '22,900', '220,000', '23,100', '23,400', '23,750', '24,000', '24,300', '24,500', '25,000', '25,200', '25,650', '25,900', '26,100', '26,600', '26,820', '27,000', '27,270', '27,550', '27,900', '28,000', '28,500', '28,800', '288,000', '29,000', '29,500', '29,520', '29,700', '297,000', '3,000', '3,510', '30,400', '30,600', '31,500', '32,220', '32,400', '33,000', '33,300', '34,200', '35,100', '36,000', '36,450', '38,700', '39,420', '39,500', '4,000', '4,410', '4,500', '4,900', '4,950', '40,000', '40,500', '40,850', '42,750', '43,200', '44,100', '45,000', '45,600', '45,900', '47,700', '48,600', '49,500', '5,250', '5,310', '5,400', '5,850', '5,950', '50,350', '52,200', '53,100', '54,000', '58,000', '6,120', '6,300', '6,720', '6,750', '63,900', '64,800', '7,000', '7,020', '7,200', '7,650', '7,920', '72,000', '75,600', '78,300', '8,010', '8,100', '8,400', '8,550', '8,820', '8,910', '81,000', '88,200', '9,000', '9,100', '9,450', '9,500', '9,520', '9,720', '9,810', '9,900'])

In [25]:
book_data_gr.groups['10,080']

Int64Index([27, 49, 76, 541, 651, 802, 1339], dtype='int64')

In [26]:
book_data_gr.groups['10,080'].size

7

In [27]:
book_data_gr.get_group('10,080').head()

,book_name,book_writer,book_date,book_price,book_cover,book_page,book_size,book_weight,book_category,book_publisher,sales_point
27,알록달록,정여울,2018-08-16,"10,080",반양장본,168,128*188mm,168,에세이,천년의상상,480
49,생각이 만든 감옥,맨리 P. 홀,2018-08-20,"10,080",반양장본,208,128*188mm,208,인문학,마름돌,"1,350"
76,1984,조지 오웰,2018-08-20,"10,080",반양장본,428,135*210mm,556,소설/시/희곡,더디,160
541,첫 문장,윤성희,2018-07-25,"10,080",양장본,152,104*182mm,234,소설/시/희곡,현대문학,"1,850"
651,"야옹아, 내가 집사라도 괜찮을까?",마담툰,2018-07-19,"10,080",반양장본,176,140*200mm,232,만화,네오카툰,630

In [28]:
book_data.sales_point.dtype

dtype('O')

In [29]:
book_data.book_weight.dtype

dtype('int64')

In [30]:
book_weight = book_data.book_weight

In [31]:
for i in range(0,2000) :
    a = book_data.iloc[i].str.replace(',','')
    book_data.iloc[i] = a

In [32]:
book_data.sales_point = book_data.sales_point.astype('float64')

In [33]:
book_data.book_weight.dtype

dtype('float64')

In [34]:
book_data.head()

,book_name,book_writer,book_date,book_price,book_cover,book_page,book_size,book_weight,book_category,book_publisher,sales_point
0,올 더 빌딩스 인 런던,제임스 걸리버 핸콕,2018-08-25,14400,양장본,140,225*280mm,NaN,예술/대중문화,책발전소,110.0
1,렛 잇 블리드,이언 랜킨,2018-08-19,13320,반양장본,476,128*188mm,NaN,소설/시/희곡,오픈하우스,110.0
2,은유로 사회 읽기,대니얼 리그니,2018-08-20,39500,양장본,416,152*223mm,NaN,사회과학,한울(한울아카데미),10.0
3,유럽 맥주 여행,백경학,2018-08-24,14400,반양장본,308,150*220mm,NaN,역사,글항아리,10.0
4,이게 행복이 아니면 무엇이지,김혜령,2018-08-20,13050,반양장본,288,135*200mm,NaN,인문학,웨일북,10.0

In [35]:
book_data.book_weight = book_weight

In [36]:
book_data.head()

,book_name,book_writer,book_date,book_price,book_cover,book_page,book_size,book_weight,book_category,book_publisher,sales_point
0,올 더 빌딩스 인 런던,제임스 걸리버 핸콕,2018-08-25,14400,양장본,140,225*280mm,476,예술/대중문화,책발전소,110.0
1,렛 잇 블리드,이언 랜킨,2018-08-19,13320,반양장본,476,128*188mm,476,소설/시/희곡,오픈하우스,110.0
2,은유로 사회 읽기,대니얼 리그니,2018-08-20,39500,양장본,416,152*223mm,749,사회과학,한울(한울아카데미),10.0
3,유럽 맥주 여행,백경학,2018-08-24,14400,반양장본,308,150*220mm,400,역사,글항아리,10.0
4,이게 행복이 아니면 무엇이지,김혜령,2018-08-20,13050,반양장본,288,135*200mm,374,인문학,웨일북,10.0

In [37]:
book_data.groupby('book_cover').agg({'book_name':'count',
                                     'sales_point':'mean', 
                                     'book_weight':'mean'})

            book_name  sales_point  book_weight
book_cover
반양장본             1553  3522.652930   494.649066
양장본               447  4171.825503   582.709172

In [38]:
book_new = book_data.groupby('book_date').agg({'book_name':'count',
                                     'sales_point':'mean', 
                                     'book_weight':'mean'})

In [39]:
book_new = book_new.sort_index()

In [40]:
book_new.head()

            book_name  sales_point  book_weight
book_date
2018-01-01          1        310.0        513.0
2018-03-20          1      42477.0        416.0
2018-03-23          1         80.0        408.0
2018-04-01          1        140.0        406.0
2018-04-10          1        150.0       1719.0

In [41]:
book_new.columns = ['book_count','sales_point', 'book_weight']

In [42]:
book_new.head()

            book_count  sales_point  book_weight
book_date
2018-01-01           1        310.0        513.0
2018-03-20           1      42477.0        416.0
2018-03-23           1         80.0        408.0
2018-04-01           1        140.0        406.0
2018-04-10           1        150.0       1719.0

In [43]:
book_new.nlargest(5,columns='book_count')

            book_count  sales_point  book_weight
book_date
2018-07-20         101  2936.079208   531.326733
2018-06-20          90  6455.222222   488.522222
2018-06-15          89  3370.337079   541.022472
2018-06-25          89  8031.067416   552.314607
2018-07-25          70  2968.285714   476.857143

In [44]:
book_new.nsmallest(5,columns='book_count')

            book_count  sales_point  book_weight
book_date
2018-01-01           1        310.0        513.0
2018-03-20           1      42477.0        416.0
2018-03-23           1         80.0        408.0
2018-04-01           1        140.0        406.0
2018-04-10           1        150.0       1719.0

## 예제 6-10 여러개 열을 그룹화하기

In [45]:
group_cols = ['book_date','book_cover']

In [46]:
agg_cols=['sales_point','book_weight']

In [47]:
fg = book_data.groupby(group_cols)[agg_cols].agg(['sum','mean','size'])

In [48]:
fg.head()

                      sales_point               book_weight
                              sum     mean size         sum    mean size
book_date  book_cover
2018-01-01 반양장본             310.0    310.0    1         513   513.0    1
2018-03-20 반양장본           42477.0  42477.0    1         416   416.0    1
2018-03-23 양장본               80.0     80.0    1         408   408.0    1
2018-04-01 반양장본             140.0    140.0    1         406   406.0    1
2018-04-10 양장본              150.0    150.0    1        1719  1719.0    1

In [49]:
level1 = fg.columns.get_level_values(0)

In [50]:
level2 = fg.columns.get_level_values(1)

In [51]:
fg.columns = level1 + '_' + level2

In [52]:
fg.head()

,,sales_point_sum,sales_point_mean,sales_point_size,book_weight_sum,book_weight_mean,book_weight_size
book_date,book_cover,,,,,,
2018-01-01,반양장본,310.0,310.0,1,513,513.0,1
2018-03-20,반양장본,42477.0,42477.0,1,416,416.0,1
2018-03-23,양장본,80.0,80.0,1,408,408.0,1
2018-04-01,반양장본,140.0,140.0,1,406,406.0,1
2018-04-10,양장본,150.0,150.0,1,1719,1719.0,1

In [53]:
fg_ = book_data.groupby(group_cols)[agg_cols].transform('sum')

In [54]:
fg_.head()

   sales_point  book_weight
0        470.0          865
1        110.0          476
2       4430.0         2627
3      47490.0         5973
4      82390.0        17282

In [68]:
book_data.groupby(group_cols).apply(lambda x: x['sales_point']* 100).head()

book_date   book_cover
2018-01-01  반양장본        1960      31000.0
2018-03-20  반양장본        1014    4247700.0
2018-03-23  양장본         563        8000.0
2018-04-01  반양장본        882       14000.0
2018-04-10  양장본         1145      15000.0
Name: sales_point, dtype: float64

In [77]:
book_data.groupby(group_cols)['sales_point'].transform(lambda x: x * 100).head()

0    11000.0
1    11000.0
2     1000.0
3     1000.0
4     1000.0
Name: sales_point, dtype: float64

In [78]:
book_data.groupby(group_cols)[['sales_point']].transform(lambda x: x * 100).head()

   sales_point
0      11000.0
1      11000.0
2       1000.0
3       1000.0
4       1000.0

In [79]:
book_data.groupby(group_cols)['sales_point', 'book_weight'].transform(lambda x: x * 100).head()

   sales_point  book_weight
0      11000.0        47600
1      11000.0        47600
2       1000.0        74900
3       1000.0        40000
4       1000.0        37400

## 예제 6-11 그룹화 처리 비교하기

SELECT book_date, count(*)
FROM book_data
GROUP BY book_date;

In [55]:
book_data.groupby('book_date').size().head()

book_date
2018-01-01    1
2018-03-20    1
2018-03-23    1
2018-04-01    1
2018-04-10    1
dtype: int64

In [56]:
book_data.groupby('book_date').count().head()

,book_name,book_writer,book_price,book_cover,book_page,book_size,book_weight,book_category,book_publisher,sales_point
book_date,,,,,,,,,,
2018-01-01,1,1,1,1,1,1,1,1,1,1
2018-03-20,1,1,1,1,1,1,1,1,1,1
2018-03-23,1,1,1,1,1,1,1,1,1,1
2018-04-01,1,1,1,1,1,1,1,1,1,1
2018-04-10,1,1,1,1,1,1,1,1,1,1

In [57]:
book_data.groupby('book_date')['sales_point'].count().head()

book_date
2018-01-01    1
2018-03-20    1
2018-03-23    1
2018-04-01    1
2018-04-10    1
Name: sales_point, dtype: int64

SELECT book_date, AVG('sales_point'), COUNT(*)
FROM book_data
GROUP BY book_date;

In [58]:
import numpy as np

In [59]:
book_data.groupby('book_date').agg({'sales_point': np.mean, 
                                    'book_date': np.size}).head()

            sales_point  book_date
book_date
2018-01-01        310.0          1
2018-03-20      42477.0          1
2018-03-23         80.0          1
2018-04-01        140.0          1
2018-04-10        150.0          1

SELECT book_date,book_cover, COUNT(*), AVG(sales_point)
FROM book_data
GROUP BY book_date,book_cover;

In [60]:
book_data.groupby(['book_date','book_cover']).agg({'sales_point': [np.size, np.mean]}).head()

                      sales_point
                             size     mean
book_date  book_cover
2018-01-01 반양장본               1.0    310.0
2018-03-20 반양장본               1.0  42477.0
2018-03-23 양장본                1.0     80.0
2018-04-01 반양장본               1.0    140.0
2018-04-10 양장본                1.0    150.0